In [1]:
import pandas as pd

In [2]:
# Creating Series
grades_dict = {'a': 5, 'b': 4, 'c': 6, 'd': 1}
grades = pd.Series(grades_dict)

marks_dict = {'a': 50, 'b': 70, 'c': 30, 'd': 100}
marks = pd.Series(marks_dict)

In [4]:
# Converting Series to DF
df = pd.DataFrame({'Grades': grades, 'Marks': marks})
df

   Grades  Marks
a       5     50
b       4     70
c       6     30
d       1    100

In [5]:
df.T

         a   b   c    d
Grades   5   4   6    1
Marks   50  70  30  100

In [6]:
df

   Grades  Marks
a       5     50
b       4     70
c       6     30
d       1    100

In [7]:
df.values

array([[  5,  50],
       [  4,  70],
       [  6,  30],
       [  1, 100]], dtype=int64)

In [8]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [9]:
df.values[2:4]

array([[  6,  30],
       [  1, 100]], dtype=int64)

In [10]:
df

   Grades  Marks
a       5     50
b       4     70
c       6     30
d       1    100

In [15]:
# to add a new column
df['ScaledMarks'] = 100*(df['Marks']/90)
df

   Grades  Marks  ScaledMarks
a       5     50    55.555556
b       4     70    77.777778
c       6     30    33.333333
d       1    100   111.111111

In [16]:
# to delete a column
del df['ScaledMarks']
df

   Grades  Marks
a       5     50
b       4     70
c       6     30
d       1    100

In [18]:
# filtering
df[df['Marks'] > 50]

   Grades  Marks
b       4     70
d       1    100